Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/WMP_old/WMP_old.tmx
Source language: en_us
Languages: de_de

source: a request for a notification of the altitude change of the wireless device; and
de_de: eine Anforderung für eine Benachrichtigung über die Höhenänderung des kabellosen Endgeräts; und

source: the threshold for determining the altitude change.
de_de: den Schwellenwert zum Bestimmen der Höhenänderung.

source: 4. The method of claim 3, wherein the request message comprises an event exposure subscribe request message.
de_de: 4. Verfahren nach Anspruch 3, wobei die Anforderungsnachricht eine Ereignis-Exposure-Abonnement-Anforderungsnachricht umfasst.

source: 5. The method of one of claims 2 to 4, further comprising sending, by the AMF to the base station, a location reporting request for the notification of the altitude change of the wireless device based on the threshold.
de_de: 5. Verfahren nach einem der Ansprüche 2 bis 4, ferner umfassend Senden einer Standortmeldungsanforderung durch die AMF an die Basisstation zur Benachrichtigung über die Höhenänderung des kabellosen Endgeräts auf der Grundlage des Schwellenwerts.

source: 6. The method of one of claims 1 to 5, wherein the threshold is associated with an upper height level for the altitude change; and wherein the message notifying the altitude change indicates that the wireless device is above the upper height level.
de_de: 6. Verfahren nach einem der Ansprüche 1 bis 5, wobei der Schwellenwert mit einem oberen Höhenniveau für die Höhenänderung assoziiert ist; und wobei die Nachricht, die die Höhenänderung mitteilt, anzeigt, dass sich das kabellose Endgerät oberhalb des oberen Höhenniveaus befindet.

source: receiving, by a base station from an access and mobility management function, AMF, a request for a notification of an altitude change of a wireless device based on a threshold; and
de_de: Empfangen einer Anforderung für eine Benachrichtigung über eine Höhenänderung eines kabellosen Endgeräts auf der Grundlage eines Schwellenwerts durch eine Basisstation von einer Zugangs- und Mobilitätsverwaltungsfunktion (AMF); und

source: sending, by the base station to the AMF and based on the request, a location report indicating that an altitude of the wireless device is changed.
de_de: Senden eines Standortberichts, der angibt, dass sich die Höhe des kabellosen Endgeräts geändert hat, durch die Basisstation an die AMF und auf der Grundlage der Anforderung.

source: 8. The method of claim 7, further comprising:
de_de: 8. Verfahren nach Anspruch 7, ferner umfassend:

source: sending, by the base station to the wireless device, a radio resource control, RRC, message indicating a measurement report for a change in height of the wireless device; and
de_de: Senden einer Funkressourcensteuerungsnachricht (RRC) von der Basisstation an das kabellose Endgerät, die einen Messbericht für eine Höhenänderung des kabellosen Endgeräts angibt; und

source: receiving, by the base station from the wireless device, an RRC response message notifying the change in height of the wireless device.
de_de: Empfangen einer RRC-Antwortnachricht durch die Basisstation von dem kabellosen Endgerät, die die Änderung der Höhe des kabellosen Endgeräts mitteilt.

source: 9. The method of one of claims 7 to 8, wherein the threshold comprises at least one of:
de_de: 9. Verfahren nach einem der Ansprüche 7 bis 8, wobei der Schwellenwert mindestens eines der Folgenden umfasst:

source: an upper height level; or
de_de: eine oberes Höhenniveau; oder

source: a lower height level.
de_de: ein unteres Höhenniveau.

source: The method of claim 9, wherein the location report indicates that the wireless device is above the upper height level.
de_de: Verfahren nach Anspruch 9, wobei der Standortbericht angibt, dass sich das kabellose Endgerät oberhalb des oberen Höhenniveaus befindet.

source: The method of claim 9, wherein the location report indicates that the wireless device is below the lower height level.
de_de: Verfahren nach Anspruch 9, wobei der Standortbericht angibt, dass sich das kabellose Endgerät unterhalb des unteren Höhenniveaus befindet.

source: The method of one of claims 8 to 11, wherein the RRC message comprises an RRC connection reconfiguration message.
de_de: Verfahren nach einem der Ansprüche 8 bis 11, wobei die RRC-Nachricht eine RRC-Verbindungs-Neukonfigurationsnachricht umfasst.

source: The method of one of claims 8 to 11, wherein the RRC message comprises an RRC resume message.
de_de: Verfahren nach einem der Ansprüche 8 bis 11, wobei die RRC-Nachricht eine RRC-Wiederaufnahme-Nachricht umfasst.

source: An apparatus, comprising one or more processors and memory storing instructions that, when executed by the one or more processors, cause the apparatus to perform the method of any of claims 1 to 13.
de_de: Vorrichtung, umfassend einen oder mehrere Prozessoren und einen Speicher, der Befehle speichert, die, wenn sie von dem einen oder mehreren Prozessoren ausgeführt werden, die Vorrichtung dazu veranlassen, das Verfahren nach einem der Ansprüche 1 bis 13 durchzuführen.

source: A non-transitory computer-readable medium comprising instructions that, when executed by one or more processors of an apparatus, cause the apparatus to perform the method of any of claims 1 to 13.
de_de: Nichttransitorisches computerlesbares Medium, umfassend Anweisungen, die, wenn sie durch einen oder mehrere Prozessoren einer Vorrichtung ausgeführt werden, die Vorrichtung veranlassen, das Verfahren nach einem der Ansprüche 1 bis 13 durchzuführen.

source: Claims
de_de: Patentansprüche

source: 1. An apparatus (100; 900; 1000) comprising:
de_de: 1. Vorrichtung (100; 900; 1000), umfassend:

source: a body section (160; 1060), the body section (160; 1060) configured for positioning adjacent to a first side (14) of a supporting structure (10), the body section (160; 1060) having a bottom portion (268); and
de_de: einen Körperteil (160; 1060), wobei der Körperteil (160; 1060) zum Positionieren benachbart zu einer ersten Seite (14) einer Stützstruktur (10) konfiguriert ist, wobei der Körperteil (160; 1060) einen unteren Abschnitt (268) aufweist; und

source: a mounting section (102; 902; 1002), the mounting section (102; 902; 1002) extending from the bottom portion (268) of the body section (160; 1060), the mounting section (102; 902; 1002) configured for insertion into a mounting aperture (20) defined in the supporting structure first side (14), the mounting section (102; 902; 1002) comprising:
de_de: einen Befestigungsteil (102; 902; 1002), wobei der Befestigungsteil (102; 902; 1002) sich von dem unteren Abschnitt (268) des Körperteils (160; 1060) erstreckt, der Befestigungsteil (102; 902; 1002) zur Einführung in eine in der ersten Seite (14) der Stützstruktur definierte Befestigungsöffnung (20) konfiguriert ist, wobei der Befestigungsteil (102; 902; 1002) Folgendes umfasst:

source: a mounting stud (104; 1004);
de_de: einen Befestigungsbolzen (104; 1004);

source: a first branch (318; 1012) extending from the mounting stud (104; 1004);
de_de: eine erste Abzweigung (318; 1012), die sich von dem Befestigungsbolzen (104; 1004) erstreckt;

source: a second branch (320; 1014) extending from the mounting stud (104; 1004), the second branch (320; 1014) spaced apart from the first branch (318; 1004), the first branch (318; 1004) positioned between the body section (160; 1060) and the second branch (320; 1014), the first branch (318; 1012) and the second branch (320; 1014) configured for deflection in a direction of the body section (160; 1060) upon insertion of the mounting section (102; 902; 1002) into the mounting aperture (20), the second branch (320; 1014) further comprising an upper side (226; 1026) facing the body section (160; 1060),
de_de: eine zweite Abzweigung (320; 1014), die sich von dem Befestigungsbolzen (104; 1004) erstreckt, wobei die zweite Abzweigung (320; 1014) von der ersten Abzweigung (318; 1004) beabstandet ist, die erste Abzweigung (318; 1004) zwischen dem Körperteil (160; 1060) und der zweiten Abzweigung (320; 1014) positioniert ist und die erste Abzweigung (318; 1012) und die zweite Abzweigung (320; 1014) zur Ablenkung bei Einführung des Befestigungsteils (102; 902; 1002) in die Befestigungsöffnung (20) in eine Richtung des Körperteils (160; 1060) konfiguriert sind, die zweite Abzweigung (320; 1014) ferner umfassend eine dem Körperteil (160; 1060) zugewandte obere Seite (226; 1026),

source: the first branch (318; 1012) further comprising:
de_de: die erste Abzweigung (318; 1012) ferner umfassend:

source: a lower side (328; 1028), the lower side (328; 1028) facing the upper side (326; 1026) of the second branch (320; 1014); and
de_de: eine untere Seite (328; 1028), wobei die untere Seite (328; 1028) der oberen Seite (326; 1026) der zweiten Abzweigung (320; 1014) zugewandt ist; und

source: a flange member (350; 950; 1050) extending from the lower side (328; 1028), the flange member (350; 950; 1050) configured for contacting the upper side (328; 1026) of the second branch (320; 1014) during insertion of the mounting section (102; 902; 1002) into the mounting aperture (20) to limit a deflection of the second branch (320; 1014) in the direction of the body section (160; 1060),
de_de: ein Flanschelement (350; 950; 1050), das sich von der unteren Seite (328; 1028) erstreckt, wobei das Flanschelement (350; 950; 1050) zum In-Kontakt-Kommen während einer Einführung des Befestigungsteils (102; 902; 1002) in die Befestigungsöffnung (20) mit der oberen Seite (328; 1026) der zweiten Abzweigung (320; 1014) konfiguriert ist, um eine Ablenkung der zweiten Abzweigung (320; 1014) in die Richtung des Körperteils (160; 1060) zu begrenzen,

source: characterized in that the first branch (318) further comprises:
de_de: dadurch gekennzeichnet, dass die erste Abzweigung (318) ferner Folgendes umfasst:

source: a root (230) connecting to the mounting stud (104);
de_de: eine Basis (230), verbunden mit dem Befestigungsbolzen (104);

source: an end (232) spaced apart from the root (230); and
de_de: ein Ende (232), beabstandet von der Basis (230); und

source: a fin portion (234) defined between the root (320) and the end (232), the fin portion (234) spaced apart from the root (230) and the end (232), the flange member (350) located on the fin portion (234), wherein the flange member (350) is spaced apart from the root (230) and the end (232).
de_de: einen Rippenabschnitt (234), definiert zwischen der Basis (320) und dem Ende (232), wobei der Rippenabschnitt (234) von der Basis (230) und dem Ende (232) beabstandet ist, wobei sich das Flanschelement (350) auf dem Rippenabschnitt (234) befindet, wobei das Flanschelement (350) von der Basis (230) und dem Ende (232) beabstandet ist.

source: 2. The apparatus of claim 1, wherein the flange member (350) extends annularly to a longitudinal axis of the mounting stud (104).
de_de: 2. Vorrichtung nach Anspruch 1, wobei sich das Flanschelement (350) ringförmig zu einer Längsachse des Befestigungsbolzens (104) erstreckt.

source: 3. The apparatus of claim 1 or 2, wherein the flange member further comprises:
de_de: 3. Vorrichtung nach Anspruch 1 oder 2, wobei das Flanschelement ferner Folgendes umfasst:

source: a single flange member segment (950) that extends along the lower side of the first branch.
de_de: ein einzelnes Flanschelementsegment (950), das sich entlang der unteren Seite der ersten Abzweigung erstreckt.

source: 4. The apparatus of any one of the preceding claims, wherein the flange member (350) further comprises:
de_de: 4. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei das Flanschelement (350) ferner Folgendes umfasst:

source: multiple flange member segments that extend along the lower side (328) of the first branch (318).
de_de: mehrere Flanschelementsegmente, die sich entlang der unteren Seite (328) der ersten Abzweigung (318) erstrecken.

source: 5. The apparatus of any one of the preceding claims, wherein the flange member (350) further comprises:
de_de: 5. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei das Flanschelement (350) ferner Folgendes umfasst:

source: an outer ramp portion (404) extending away from the lower side (328) of the first branch (318);
de_de: einen äußeren Rampenabschnitt (404), der sich von der unteren Seite (328) der ersten Abzweigung (318) weg erstreckt;

source: an inner ramp portion (406) extending away from the lower side (328) of the first branch (318); and
de_de: einen inneren Rampenabschnitt (406), der sich von der unteren Seite (328) der ersten Abzweigung (318) weg erstreckt; und

source: a flat portion (402) extending between the outer ramp portion (404) and the inner ramp portion (406).
de_de: einen flachen Abschnitt (402), der sich zwischen dem äußeren Rampenabschnitt (404) und dem inneren Rampenabschnitt (406) erstreckt.

source: 6. The apparatus of any one of the preceding claims, further comprising:
de_de: 6. Vorrichtung nach einem der vorhergehenden Ansprüche, ferner umfassend:

source: a third branch (1016) extending from the mounting stud (1004), the third branch (1016) spaced apart from the second branch (1014), the second branch (1014) positioned between the body section (1060) and the third branch (1016), the third branch (1016) configured to deform in a direction of the body section (1060) upon insertion of the mounting section (1002) into the mounting aperture, the third branch (1016) further comprising a third branch upper side facing the body section (1060),
de_de: eine dritte Abzweigung (1016), die sich von dem Befestigungsbolzen (1004) erstreckt, wobei die dritte Abzweigung (1016) von der zweiten Abzweigung (1014) beabstandet ist, die zweite Abzweigung (1014) zwischen dem Körperteil (1060) und der dritten Abzweigung (1016) positioniert ist, die dritte Abzweigung (1016) konfiguriert ist, um sich bei Einführung des Befestigungsteils (1002) in die Befestigungsöffnung in Richtung des Körperteils (1060) zu verformen, die dritte Abzweigung (1016) ferner umfassend eine obere Seite der dritten Abzweigung, die dem Körperteil (1060) zugewandt ist,

source: wherein the second branch (1014) further comprises a second flange member extending from a second branch lower side, the second flange member configured for contacting the third branch upper side of the third branch (1016) during insertion of the mounting section (1002) into the mounting aperture to limit the deflection of the third branch (1016) in the direction of the body section (1060).
de_de: wobei die zweite Abzweigung (1014) ferner ein zweites Flanschelement umfasst, das sich von einer unteren Seite der zweiten Abzweigung erstreckt, wobei das zweite Flanschelement zum In-Kontakt-Kommen während einer Einführung des Befestigungsteils (1002) in die Befestigungsöffnung mit der oberen Seite der dritten Abzweigung (1016) konfiguriert ist, um die Ablenkung der dritten Abzweigung (1016) in die Richtung des Körperteils (1060) zu begrenzen.

source: 7. The apparatus of any one of the preceding claims, wherein the mounting section (102) further comprises:
de_de: 7. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei der Befestigungsteil (102) ferner Folgendes umfasst:

source: a cap portion (138) extending away from the bottom portion (268) of the body section (160), the cap portion (138) shaped with a profile configured to receive a portion of a branch (140) of the mounting section (102).
de_de: einen Kappenabschnitt (138), der sich von dem unteren Abschnitt (268) des Körperteils (160) weg erstreckt, wobei der Kappenabschnitt (138) mit einem Profil geformt ist, das konfiguriert ist, um einen Abschnitt einer Abzweigung (140) des Befestigungsteils (102) aufzunehmen.

source: 8. The apparatus of claim 7, wherein the portion of the branch (140) of the mounting section (102) received into the profile is an uppermost branch.
de_de: 8. Vorrichtung nach Anspruch 7, wobei der Abschnitt der Abzweigung (140) des Befestigungsteils (102), der in das Profil aufgenommen wird, eine oberste Abzweigung ist.

source: 9. The apparatus of claim 7, wherein the cap portion (138) comprises an axially extending flange (242) shaped to receive a portion of a branch (140) of the mounting section (102).
de_de: 9. Vorrichtung nach Anspruch 7, wobei der Kappenabschnitt (138) einen sich axial erstreckenden Flansch (242) umfasst, geformt, um einen Abschnitt einer Abzweigung (140) des Befestigungsteils (102) aufzunehmen.

source: The apparatus of any one of the preceding claims,
de_de: Vorrichtung nach einem der vorhergehenden Ansprüche,

source: wherein the second branch (1014) further comprises:
de_de: wobei die zweite Abzweigung (1014) ferner Folgendes umfasst:

source: a lower side (228), the lower side (228) facing away from the body section (1060); and
de_de: eine untere Seite (228), wobei die untere Seite (228) von dem Körperteil (1060) abgewandt ist; und

source: a flange member (350) extending from the lower side (228), the flange member (350) configured for contacting an upper side of a third branch (1016) during insertion of the mounting section into the mounting aperture (20) to limit a deflection of the third branch (1016) in the direction of the body section (1060), wherein the first branch (1012) and the second branch (1014) each further comprise:
de_de: ein Flanschelement (350), das sich von der unteren Seite (228) erstreckt, wobei das Flanschelement (350) zum In-Kontakt-Kommen während einer Einführung des Befestigungsteils in die Befestigungsöffnung (20) mit einer oberen Seite einer dritten Abzweigung (1016) konfiguriert ist, um eine Ablenkung der dritten Abzweigung (1016) in die Richtung des Körperteils (1060) zu begrenzen, wobei die erste Abzweigung (1012) und die zweite Abzweigung (1014) jeweils ferner Folgendes umfassen:

source: a root (320) connecting to the mounting stud (104);
de_de: eine Basis (320), verbunden mit dem Befestigungsbolzen (104);

source: an end (232) spaced apart from the root (320); and
de_de: ein Ende (232), beabstandet von der Basis (320); und

source: a fin portion (234) defined between the root (320) and the end (232), the fin portion (234) spaced apart from the root (320) and the end (232), wherein the flange members (350) of the first branch (1012) and the second branch (1014) are located on their respective fin portions (234), the flange members (350) of the first branch (1012) and the second branch (1014) are spaced apart from their respective roots (320) and ends (232).
de_de: einen Rippenabschnitt (234), definiert zwischen der Basis (320) und dem Ende (232), wobei der Rippenabschnitt (234) von der Basis (320) und dem Ende (232) beabstandet ist, wobei sich die Flanschelemente (350) der ersten Abzweigung (1012) und der zweiten Abzweigung (1014) an ihren jeweiligen Rippenabschnitten befinden (234), wobei die Flanschelemente (350) der ersten Abzweigung (1012) und der zweiten Abzweigung (1014) von ihren jeweiligen Basen (320) und Enden (232) beabstandet sind.

source: The apparatus of claim 10,
de_de: Vorrichtung nach Anspruch 10,

source: wherein the first branch and the second branch are branches in an array (522) of branches (112),
de_de: wobei die erste Abzweigung und die zweite Abzweigung Abzweigungen in einer Reihe (522) von Abzweigungen (112) sind,

source: wherein multiple of the branches in the array (522) of branches (112) each comprise a flange member (350),
de_de: wobei mehrere der Abzweigungen in der Reihe (522) von Abzweigungen (112) jeweils ein Flanschelement (350) umfassen,

source: wherein the apparatus further comprises a second array (524) of branches (112),
de_de: wobei die Vorrichtung ferner eine zweite Reihe (524) von Abzweigungen (112) umfasst,

source: wherein the array (524) of branches (112) extends along a first peripheral region of the mounting stud (104), and
de_de: wobei sich die Reihe (524) von Abzweigungen (112) entlang eines ersten peripheren Bereichs des Befestigungsbolzens (104) erstreckt, und

source: wherein the second array (524) of branches extends along a second peripheral region of the mounting stud (104).
de_de: wobei sich die zweite Reihe (524) von Abzweigungen entlang eines zweiten peripheren Bereichs des Befestigungsbolzens (104) erstreckt.

source: The apparatus of any one of the preceding claims, wherein the first branch and the second branch (320; 1014) extend radially from the mounting stud (104; 1004).
de_de: Vorrichtung nach einem der vorhergehenden Ansprüche, wobei sich die erste Abzweigung und die zweite Abzweigung (320; 1014) radial von dem Befestigungsbolzen (104; 1004) erstrecken.

source: The apparatus of any one of the preceding claims, wherein the first branch (318; 1012) and the second branch (320; 1014) are branches in an array (522) of branches (112) that extend radially from the mounting stud (104; 1004).
de_de: Vorrichtung nach einem der vorhergehenden Ansprüche, wobei die erste Abzweigung (318; 1012) und die zweite Abzweigung (320; 1014) Abzweigungen in einer Reihe (522) von Abzweigungen (112) sind, die sich radial von dem Befestigungsbolzen (104; 1004) erstrecken.

source: The apparatus of any one of the preceding claims, further comprising:
de_de: Vorrichtung nach einem der vorhergehenden Ansprüche, ferner umfassend:

source: a connector section (170) attaching to the body section (160; 1060), the connector section (170) configured for connecting with an object support configured for attaching to a component.
de_de: einen Verbindungsteil (170), der an dem Körperteil (160; 1060) angebracht ist, wobei der Verbindungsteil (170) zum Verbinden mit einer Objektstütze konfiguriert ist, die zum Anbringen an einer Komponente konfiguriert ist.
